src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваПряжи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_ЧекЛистПроверкиКачестваПряжи</Name>
			<BasedOn>
				<xr:Item>Document.КСП_ПроверочнаяВедомость</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_ПроверкаКачестваПряжиПоЧекЛистам</xr:Item>
				<xr:Item>InformationRegister.КСП_ПаспортКачества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КСП_ПроверочнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийКачество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяПеремоткаНеПроводилась</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоЛотам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВизуальныйОсмотрПроверкаЗавершена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВизуальныйОсмотрДатаЗавершенияПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяПеремоткаПроверкаЗавершена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяПеремоткаДатаЗавершенияПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБобин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПунктыПроверкиВизуальногоОсмотра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольнаяПеремотка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверил</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФотоДефектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроверки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КСП_ЭтапыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_ПроверкаКачестваПряжиПоЧекЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_ПроверкаКачестваПряжиПоЧекЛистам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоБобин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВизуальныйОсмотрПроверкаЗавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВизуальныйОсмотрДатаЗавершенияПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольнаяПеремоткаПроверкаЗавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольнаяПеремоткаДатаЗавершенияПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_СпецТипНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_СпецТипНакладной</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ткань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТкань</Name>
					<Comment>НеТкань</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фурнитура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пряжа</Name>
					<Comment>не_использовать! Т.к. лот и партия сырья включены теперь в характеристику и применяются стандартные механизмы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПряжаЛот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДавальческоеСырье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХимРеактивы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_ЭтапыПроверкиКачестваПоЧекЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_ЭтапыПроверкиКачестваПоЧекЛистам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВизуальныйКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольнаяПеремотка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестовыйОтвяз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Documents/ПриходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриходныйОрдерНаТовары</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КСП_ПроверочнаяВедомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КСП_ПроверочнаяВедомость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КСП_КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Catalogs/КСП_ПунктыПроверкиКачестваПоЧекЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_ПунктыПроверкиКачестваПоЧекЛистам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиВключатьВЧекЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_ЭтапыПроверкиКачестваПоЧекЛистам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваПряжи/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	РегламентированнаяОтчетность.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
КонецПроцедуры 

Функция ПолучитьПунктыПроверкиДляАвтозаполнения(ЭтапПроверки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПунктыПроверкиКачестваПоЧекЛистам.Ссылка КАК ПунктПроверки
		|ИЗ
		|	Справочник.КСП_ПунктыПроверкиКачестваПоЧекЛистам КАК ПунктыПроверкиКачестваПоЧекЛистам
		|ГДЕ
		|	ПунктыПроверкиКачестваПоЧекЛистам.ПометкаУдаления = ЛОЖЬ
		|	И ПунктыПроверкиКачестваПоЧекЛистам.АвтоматическиВключатьВЧекЛисты = ИСТИНА
		|	И ПунктыПроверкиКачестваПоЧекЛистам.ЭтапПроверки = &ЭтапПроверки";
	
	Запрос.УстановитьПараметр("ЭтапПроверки", ЭтапПроверки);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДанныеДляЗаполненияТовары(ПроверочнаяВедомость)
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|			ПроверочнаяВедомостьТовары.Номенклатура,
	|			ПроверочнаяВедомостьТовары.Характеристика,
	|			Выбор КОгда ПроверочнаяВедомостьТовары.ЕдиницаИзмерения = Значение(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) Тогда
	|			ПроверочнаяВедомостьТовары.Ссылка.ЕдиницаИзмерения
	|			Иначе ПроверочнаяВедомостьТовары.ЕдиницаИзмерения Конец Как ЕдиницаИзмерения,
	|			ПроверочнаяВедомостьТовары.Коэффициент,
	|			//ПриходныйОрдерНаТоварыТовары.ПоЛотам,
	|			СУММА(ПриходныйОрдерНаТоварыТовары.Количество) КАК Количество
	|		ИЗ
	|			Документ.КСП_ПроверочнаяВедомость.Товары КАК ПроверочнаяВедомостьТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|				ПО ПроверочнаяВедомостьТовары.Ссылка = ПриходныйОрдерНаТоварыТовары.КСП_ПроверочнаяВедомость
	|					И ПроверочнаяВедомостьТовары.Номенклатура = ПриходныйОрдерНаТоварыТовары.Номенклатура
	|					И ПроверочнаяВедомостьТовары.Характеристика = ПриходныйОрдерНаТоварыТовары.Характеристика
	|		ГДЕ
	|			ПроверочнаяВедомостьТовары.Ссылка = &ПроверочнаяВедомость
	|		
	|		СГРУППИРОВАТЬ ПО
	|			//ПриходныйОрдерНаТоварыТовары.ПоЛотам,
	|			Выбор КОгда ПроверочнаяВедомостьТовары.ЕдиницаИзмерения = Значение(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) Тогда
	|			ПроверочнаяВедомостьТовары.Ссылка.ЕдиницаИзмерения
	|			Иначе ПроверочнаяВедомостьТовары.ЕдиницаИзмерения Конец,
	|			ПроверочнаяВедомостьТовары.Номенклатура,
	|			ПроверочнаяВедомостьТовары.Характеристика,
	|			ПроверочнаяВедомостьТовары.Коэффициент";
	
	Запрос.УстановитьПараметр("ПроверочнаяВедомость", ПроверочнаяВедомость);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КСП_ПроверочнаяВедомость") Тогда
		Если (ДанныеЗаполнения.СпецТипНакладной <> Перечисления.КСП_СпецТипНакладной.Пряжа) и (ДанныеЗаполнения.СпецТипНакладной <> Перечисления.КСП_СпецТипНакладной.ПряжаЛот) Тогда
			Сообщить("В документе основании документа " + ДанныеЗаполнения + " спец тип накладной должен быть ""Пряжа"" или ""Пряжа (лот)""");
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения;
		Комментарий = "Введен на основании документа " + ДанныеЗаполнения; 
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДатаПоступления = ДанныеЗаполнения.ДокументОснование.Дата;
		ПунктыПроверкиДляАвтозаполнения = ПолучитьПунктыПроверкиДляАвтозаполнения(Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль);
        Товары.Загрузить(ПолучитьДанныеДляЗаполненияТовары(ДанныеЗаполнения));
		ПунктыПроверкиВизуальногоОсмотра.Очистить();
		КонтрольнаяПеремотка.Очистить();
		ФотоДефектов.Очистить();
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			ТекСтрокаТовары.КлючСтроки = Новый УникальныйИдентификатор;
			Для Каждого ПунктПроверкиДляАвтозаполнения Из ПунктыПроверкиДляАвтозаполнения Цикл
				СтрокаПунктыПроверкиВизуальногоОсмотра = ПунктыПроверкиВизуальногоОсмотра.Добавить();
				СтрокаПунктыПроверкиВизуальногоОсмотра.КлючСтроки = ТекСтрокаТовары.КлючСтроки;
				СтрокаПунктыПроверкиВизуальногоОсмотра.ПунктПроверки = ПунктПроверкиДляАвтозаполнения.ПунктПроверки;
				СтрокаПунктыПроверкиВизуальногоОсмотра.КлючСтрокиДляСвязиСФото = Новый УникальныйИдентификатор;
			КонецЦикла;
		КонецЦикла;   
		ПунктыПроверкиДляАвтозаполнения = ПолучитьПунктыПроверкиДляАвтозаполнения(Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.КонтрольнаяПеремотка);
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Для Каждого ПунктПроверкиДляАвтозаполнения Из ПунктыПроверкиДляАвтозаполнения Цикл
				СтрокаКонтрольнаяПеремотка = КонтрольнаяПеремотка.Добавить();
				СтрокаКонтрольнаяПеремотка.КлючСтроки = ТекСтрокаТовары.КлючСтроки;
				СтрокаКонтрольнаяПеремотка.ПунктПроверки = ПунктПроверкиДляАвтозаполнения.ПунктПроверки;
				СтрокаКонтрольнаяПеремотка.КлючСтрокиДляСвязиСФото = Новый УникальныйИдентификатор;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТаблицуПроведенияПоРегиструПроверкаКачестваПряжиПоЧекЛистам()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.Организация,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.Контрагент,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.ДатаПоступления,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Количество * ЧекЛистПроверкиКачестваПряжиТовары.Коэффициент КАК Количество,
		|	ЧекЛистПроверкиКачестваПряжиТовары.КоличествоБобин,
		|	ЧекЛистПроверкиКачестваПряжиТовары.ВизуальныйОсмотрПроверкаЗавершена,
		|	ЧекЛистПроверкиКачестваПряжиТовары.ВизуальныйОсмотрДатаЗавершенияПроверки,
		|	ЧекЛистПроверкиКачестваПряжиТовары.КонтрольнаяПеремоткаПроверкаЗавершена,
		|	ЧекЛистПроверкиКачестваПряжиТовары.КонтрольнаяПеремоткаДатаЗавершенияПроверки,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваПряжи.Товары КАК ЧекЛистПроверкиКачестваПряжиТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборДвижений = Движения.КСП_ПроверкаКачестваПряжиПоЧекЛистам;  
	НаборДвижений.мТаблицаДвижений   = ПолучитьТаблицуПроведенияПоРегиструПроверкаКачестваПряжиПоЧекЛистам();
	НаборДвижений.ВыполнитьДвижения();
КонецПроцедуры
